app/Controllers/MuebleController.php

SELECT *
FROM `usuario`
WHERE `usuario`.`deleted_at` IS NULL
SELECT *
FROM `producto`
WHERE `producto`.`deleted_at` IS NULL
---
    public function create($id)
    {
        $usuario= new UsuarioModel();
        $data['usuario']= $usuario->findAll();
        $presupuesto= new PresupuestoModel();
        $data['presupuesto']= $presupuesto->find($id);
        $producto= new ProductoModel();
        $data['madera']= $producto->findAll();