app/Models/MuebleModel.php

INSERT INTO `detalle_presupuesto` (`id_presupuesto`, `id_usuario`, `nombre_mueble`, `producto1`, `precio1`, `transporte`, `descuento`, `cond_pago`, `tentrega`, `garantia`, `subtotal`, `total`, `statusmueble`, `created_at`) VALUES ('9', '3', 'Sillas De Caoba', 'Lamina de MDF', '700', '700.00', '5', '50% para iniciar el inmueble y 50% finalizado el inmueble', '2024-10-01', '2 Años', '79792.61', '75802.9795', 1, '2024-10-01')
---
    public function insertar($data)
    {
        $usuarioModel= $this->db->table('detalle_presupuesto');
        $usuarioModel->insert($data);

SELECT `detalle_presupuesto`.*, `presupuest`.*, `usuario`.*
FROM `detalle_presupuesto`
JOIN `presupuest` ON `presupuest`.`id_presupuesto` = `detalle_presupuesto`.`id_presupuesto`
JOIN `usuario` ON `usuario`.`id_usuario` = `detalle_presupuesto`.`id_usuario`
---
    public function mueblesall()
    {
        $builder = $this->db->table('detalle_presupuesto');
        $builder->select('detalle_presupuesto.*, presupuest.*, usuario.*');
        $builder->join('presupuest', 'presupuest.id_presupuesto = detalle_presupuesto.id_presupuesto');
        $builder->join('usuario', 'usuario.id_usuario = detalle_presupuesto.id_usuario');
        return $builder->get()->getResultArray();

SELECT `detalle_presupuesto`.*, `presupuest`.*, `usuario`.*
FROM `detalle_presupuesto`
JOIN `presupuest` ON `presupuest`.`id_presupuesto` = `detalle_presupuesto`.`id_presupuesto`
JOIN `usuario` ON `usuario`.`id_usuario` = `detalle_presupuesto`.`id_usuario`
WHERE `id_detalle` = 'favicon.ico'
---
    public function muebleId($id)
    {
        $builder = $this->db->table('detalle_presupuesto');
        $builder->select('detalle_presupuesto.*, presupuest.*, usuario.*');
        $builder->join('presupuest', 'presupuest.id_presupuesto = detalle_presupuesto.id_presupuesto');
        $builder->join('usuario', 'usuario.id_usuario = detalle_presupuesto.id_usuario');
        $builder->where('id_detalle',$id);
        return $builder->get()->getResultArray();